Hmm. I still get a worryingly high list of in-place changes:

```
> tfp -target='buildkite_pipeline.pipeline["infrastructure-tools"]' -out=tfplan
buildkite_pipeline.pipeline["infrastructure-tools"]: Refreshing state... [id=UGlwZWxpbmUtLS0wMTg5NDVjOC1jYzMyLTQyOTktYjExMi0xYTdjZjZlNmVhMDA=]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # buildkite_pipeline.pipeline["infrastructure-tools"] will be updated in-place
  ~ resource "buildkite_pipeline" "pipeline" {
        id                         = "UGlwZWxpbmUtLS0wMTg5NDVjOC1jYzMyLTQyOTktYjExMi0xYTdjZjZlNmVhMDA="
        name                       = "infrastructure-tools"
      ~ slug                       = "infrastructure-tools" -> (known after apply)
        tags                       = []
        # (13 unchanged attributes hidden)

      ~ provider_settings {
          + build_pull_request_forks                      = (known after apply)
          + build_pull_request_labels_changed             = (known after apply)
          + build_pull_request_ready_for_review           = (known after apply)
          + cancel_deleted_branch_builds                  = false
          + prefix_pull_request_fork_branch_names         = (known after apply)
          + publish_blocked_as_pending                    = (known after apply)
          + separate_pull_request_statuses                = (known after apply)
          + skip_builds_for_existing_commits              = (known after apply)
          + trigger_mode                                  = (known after apply)
            # (8 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

And applying still reports that there's an error and an inconsistent result, so potentially still an issue in 0.25.0:

```
> tfa tfplan && rm tfplan
buildkite_pipeline.pipeline["infrastructure-tools"]: Modifying... [id=UGlwZWxpbmUtLS0wMTg5NDVjOC1jYzMyLTQyOTktYjExMi0xYTdjZjZlNmVhMDA=]
╷
│ Warning: Applied changes may be incomplete
│
│ The plan was created with the -target option in effect, so some changes requested in the configuration may have been ignored and the output values may not be fully updated. Run
│ the following command to verify that no other changes are pending:
│     terraform plan
│
│ Note that the -target option is not suitable for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform
│ specifically suggests to use it as part of an error message.
╵
╷
│ Error: Provider produced inconsistent result after apply
│
│ When applying changes to buildkite_pipeline.pipeline["infrastructure-tools"], provider "provider[\"registry.terraform.io/buildkite/buildkite\"]" produced an unexpected new value:
│ .provider_settings[0].cancel_deleted_branch_builds: was cty.False, but now null.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.

```